#!/bin/bash

# Nombre:	flatpak-config.sh
# Autor:	Charlie Martínez® <cmartinez@quirinux.org>
# Licencia:	https://www.gnu.org/licenses/gpl-3.0.txt
# Descripción:	Utilidad gráfica para habilitar o deshabilitar flatpak
# Versión:	2.0

# =========================================================================================
# INICIO / FIN (IDIOMAS) [CÓDIGO REUTILIZABLE]
# =========================================================================================

function _inicio_es() 

{

if [ "$EUID" -ne 0 ]; then
    echo ''
    echo "Este script debe ejecutarse con permisos de root."
    echo 'Puedes intentarlo con "sudo" tuusuario, "sudo su" o "su root".'
    echo ''
    exit 1
fi
_menuPrincipal_es
}

function _inicio_de() 
{

if [ "$EUID" -ne 0 ]; then
    echo ''
    echo "Dieses Skript muss mit Root-Rechten ausgeführt werden."
    echo 'Du kannst es mit "sudo deinbenutzer", "sudo su" oder "su root" versuchen.'
    echo ''
    exit 1
fi
_menuPrincipal_de
}

function _inicio_en()
{

if [ "$EUID" -ne 0 ]; then
    echo ''
    echo "This script must be run with root permissions."
    echo 'You can try with "sudo yourusername", "sudo su", or "su root".'
    echo ''
    exit 1

fi
_menuPrincipal_en
}

function _inicio_fr() 
{

if [ "$EUID" -ne 0 ]; then
    echo ''
    echo "Ce script doit être exécuté avec des permissions de root."
    echo 'Vous pouvez essayer avec "sudo votrenomdutilisateur", "sudo su" ou "su root".'
    echo ''
    exit 1
fi
_menuPrincipal_fr
}

function _inicio_gl() 
{
if [ "$EUID" -ne 0 ]; then
    echo ''
    echo "Este script debe ser executado con permisos de root."
    echo 'Podes intentalo con "sudo o teuusuario", "sudo su" ou "su root".'
    echo ''
    exit 1
fi
_menuPrincipal_gl
}

function _inicio_it ()
{
if [ "$EUID" -ne 0 ]; then
    echo ''
    echo "Questo script deve essere eseguito con i permessi di root."
    echo 'Puoi provare con "sudo iltuoutente", "sudo su" o "su root".'
    echo ''
    exit 1
fi
_menuPrincipal_it 
}

function _inicio_pt() 
{
if [ "$EUID" -ne 0 ]; then
    echo ''
    echo "Este script deve ser executado com permissões de root."
    echo 'Você pode tentar com "sudo seunome de usuário", "sudo su" ou "su root".'
    echo ''
    exit 1
fi
_menuPrincipal_pt

}

function _inicio_ru() 
{
if [ "$EUID" -ne 0 ]; then
    echo ''
    echo "Этот скрипт должен выполняться с правами root."
    echo 'Вы можете попробовать с "sudo вашеимяпользователя", "sudo su" или "su root".'
    echo ''
    exit 1
fi
_menuPrincipal_ru

}

function _fin_en()
{
zenity --info --text "Settings made. You can always reverse them."
}

function _fin_es()
{
zenity --info --text "Configuraciones realizadas. Siempre puedes revertirlas."
}

function _fin_gl()
{
zenity --info --text "Configuración feita. Sempre os podes reverter."
}

function _fin_ru()
{
zenity --info --text "Настройки сделаны. Вы всегда можете отменить их.  "
}

function _fin_de()
{
zenity --info --text "Einstellungen vorgenommen. Sie können sie jederzeit umkehren. "
}

function _fin_pt()
{
zenity --info --text "Configurações feitas. Você sempre pode revertê-los."
}

function _fin_it ()
{
zenity --info --text "Impostazioni effettuate. Puoi sempre invertirli. "
}
function _fin_fr()
{
zenity --info --text "Paramètres définis. Vous pouvez toujours les inverser. "
}



# =========================================================================================
# SALIR [CÓDIGO REUTILIZABLE]
# =========================================================================================

function _salir()
{
exit 0
}

# =========================================================================================
# SELECTOR DE IDIOMA [CÓDIGO REUTILIZABLE]
# Esta sección fue tomada de Etertics GNU/Linux, 
# @Autor: Javier Obregón (GPLv3)
# =========================================================================================

function _idioma() 

{

IDIOMA=$(echo $LANG | cut -d_ -f1) # Idioma del sistema

if [[ $IDIOMA = "es" ]]
then
_inicio_es

elif [[ $IDIOMA = "en" ]]
then
_inicio_en

elif [[ $IDIOMA = "gl" ]]
then
_inicio_gl

elif [[ $IDIOMA = "pt" ]]
then
_inicio_pt

elif [[ $IDIOMA = "fr" ]]
then
_inicio_fr

elif [[ $IDIOMA = "it" ]]
then
_inicio_it

elif [[ $IDIOMA = "de" ]]
then
_inicio_de

elif [[ $IDIOMA = "ru" ]]
then
_inicio_ru

else
_inicio_en
fi

}

# =========================================================================================
# PROCESOS [NADA QUE TRADUCIR]
# =========================================================================================

# ACTIVAR FLATPAK

function _activar()
{

FILE="/usr/bin/mintinstall"

if [ ! -e ${FILE} ]; then
		clear
		(
		apt-get install gnome-software-plugin-flatpak -y
		echo "25"; sleep 1
		echo "# Procesando"; sleep 1
		 
		flatpak remote-add --if-not-exists flathub https://dl.flathub.org/repo/flathub.flatpakrepo
		echo "50"; sleep 1
		echo "# Procesando"; sleep 1  
		  
		sudo apt-get install gir1.2-flatpak-1.0 -y
		echo "50"; sleep 1
		echo "# Procesando"; sleep 1 

		zenity --progress --title="Configurando" --text="Ten paciencia, llevará tiempo" --percentage=0 --auto-close --auto-kill
		
		)|
		if [ "$?" = -1 ] ; then
		zenity --error --text="Configuración cancelada"
		fi

else
		( 
		sudo apt-get update -y
		echo "10"; sleep 1
		echo "# Procesando"; sleep 1

		sudo apt-get install flatpak gir1.2-flatpak-1.0 -y
		echo "15"; sleep 1
		echo "# Procesando"; sleep 1

		sudo apt-get install -f -y
		echo "20"; sleep 1
		echo "# Procesando"; sleep 1

		sudo apt-get autoremove --purge -y
		echo "25"; sleep 1
		echo "# Procesando"; sleep 1

		flatpak remote-add --if-not-exists flathub https://dl.flathub.org/repo/flathub.flatpakrepo
		echo "50"; sleep 1
		echo "# Procesando"; sleep 1

		sudo apt-get install gir1.2-flatpak-1.0 -y
		echo "100"; sleep 1
		echo "# Procesando"; sleep 1
		
		)|
		zenity --progress --title="Configurando" --text="Ten paciencia, llevará tiempo" --percentage=0 --auto-close --auto-kill
		if [ "$?" = -1 ] ; then
		zenity --error --text="Configuración cancelada"
		fi

fi

if which flatpak >/dev/null 2>&1
    then
		(		
        flatpak remote-add --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo
        echo "25"; sleep 1
		echo "# Procesando"; sleep 1
        mkdir -p /var/lib/flatpak/exports/share/applications
        echo "50"; sleep 1
		echo "# Procesando"; sleep 1
        mkdir -p /var/lib/flatpak/exports/share/icons
        echo "100"; sleep 1
		echo "# Procesando"; sleep 1
		
		)|
		zenity --progress --title="Configurando" --text="Ten paciencia, llevará tiempo" --percentage=0 --auto-close --auto-kill
		if [ "$?" = -1 ] ; then
		zenity --error --text="Configuración cancelada"
		fi
		
    fi

}

# DESACTIVAR FLATPAK

function _desactivar()
{
    (
    sudo apt-get update -y
    echo "20"; sleep 1

    # Desinstalar Flatpak por completo
    sudo apt-get remove --purge flatpak -y
    echo "40"; sleep 1

    sudo apt-get autoremove --purge -y
    echo "60"; sleep 1

    # Instalar ostree para crear un repositorio vacío válido
    sudo apt-get install -y ostree
    echo "70"; sleep 1

    # Crear repo Flatpak válido pero vacío
    sudo rm -rf /var/lib/flatpak/repo
    sudo mkdir -p /var/lib/flatpak
    sudo ostree init --mode=archive-z2 --repo=/var/lib/flatpak/repo

    echo "100"; sleep 1
    ) |
    zenity --progress --title="Configurando" --text="Ten paciencia, llevará tiempo" --percentage=0 --auto-close --auto-kill

    if [ "$?" = -1 ] ; then
        zenity --error --text="Configuración cancelada"
    fi
}



# =========================================================================================
# CASTELLANO
# =========================================================================================

function _menuPrincipal_es()
{
opPrincipal=$(
zenity --list --title "FLATPAK-CONFIG" --width="600" --height="300" \
--column="Opciones disponibles" \
"Activar Flatpak" \
"Desactivar Flatpak" \
"Salir" \
)
if [[ $opPrincipal == "Activar Flatpak" ]]; then
_activar
_fin_es
fi
if [[ $opPrincipal == "Desactivar Flatpak" ]]; then
_desactivar
_fin_es
fi
if [[ $opPrincipal == "Salir" ]]; then
_salir
fi
}

# =========================================================================================
# INGLÉS
# =========================================================================================

function _menuPrincipal_en()
{
opPrincipal=$(
zenity --list --title "FLATPAK-CONFIG" --width="600" --height="300" \
--column="Available options" \
"Activate Flatpak" \
"Disable Flatpak" \
"Exit" \
)
if [[ $opPrincipal == "Activate Flatpak" ]]; then
_activar
_fin_es
fi
if [[ $opPrincipal == "Disable Flatpak" ]]; then
_desactivar
_fin_es
fi
if [[ $opPrincipal == "Exit" ]]; then
_salir
fi
}



# =========================================================================================
# GALLEGO
# =========================================================================================

function _menuPrincipal_gl()
{
opPrincipal=$(
zenity --list --title "FLATPAK-CONFIG" --width="600" --height="300" \
--column="Opcións dispoñibles" \
"Activa Flatpak" \
"Desactivar Flatpak" \
"Saída" \
)
if [[ $opPrincipal == "Activa Flatpak" ]]; then
_activar
_fin_es
fi
if [[ $opPrincipal == "Desactivar Flatpak" ]]; then
_desactivar
_fin_es
fi
if [[ $opPrincipal == "Saída" ]]; then
_salir
fi
}



# =========================================================================================
# PORTUGUES
# =========================================================================================

function _menuPrincipal_pt()
{
opPrincipal=$(
zenity --list --title "FLATPAK-CONFIG" --width="600" --height="300" \
--column="Opções disponíveis" \
"Ativar Flatpak" \
"Desativar Flatpak" \
"Saia" \
)
if [[ $opPrincipal == "Ativar Flatpak" ]]; then
_activar
_fin_es
fi
if [[ $opPrincipal == "Desativar Flatpak" ]]; then
_desactivar
_fin_es
fi
if [[ $opPrincipal == "Saia" ]]; then
_salir
fi
}

# =========================================================================================
# FRANCÉS
# =========================================================================================

function _menuPrincipal_fr()
{
opPrincipal=$(
zenity --list --title "FLATPAK-CONFIG" --width="600" --height="300" \
--column="Options disponibles " \
"Activer Flatpak" \
"Désactiver Flatpak" \
"Sortir" \
)
if [[ $opPrincipal == "Activer Flatpak" ]]; then
_activar
_fin_es
fi
if [[ $opPrincipal == "Désactiver Flatpak" ]]; then
_desactivar
_fin_es
fi
if [[ $opPrincipal == "Sortir" ]]; then
_salir
fi
}

# =========================================================================================
# ITALIANO
# =========================================================================================

function _menuPrincipal_it ()
{
opPrincipal=$(
zenity --list --title "FLATPAK-CONFIG" --width="600" --height="300" \
--column="Opzioni disponibili" \
"Attiva Flatpak" \
"Disabilita Flatpak" \
"Esci" \
)
if [[ $opPrincipal == "Attiva Flatpak" ]]; then
_activar
_fin_es
fi
if [[ $opPrincipal == "Disabilita Flatpak" ]]; then
_desactivar
_fin_es
fi
if [[ $opPrincipal == "Esci" ]]; then
_salir
fi
}


# =========================================================================================
# ALEMAN
# =========================================================================================

function _menuPrincipal_de()
{
opPrincipal=$(
zenity --list --title "FLATPAK-CONFIG" --width="600" --height="300" \
--column="Verfügbare Optionen " \
"Flatpak aktivieren" \
"Flatpak deaktivieren" \
"Aussteigen" \
)
if [[ $opPrincipal == "Flatpak aktivieren" ]]; then
_activar
_fin_es
fi
if [[ $opPrincipal == "Flatpak deaktivieren" ]]; then
_desactivar
_fin_es
fi
if [[ $opPrincipal == "Aussteigen" ]]; then
_salir
fi
}

# =========================================================================================
# RUSO
# =========================================================================================

function _menuPrincipal_ru()
{
opPrincipal=$(
zenity --list --title "FLATPAK-CONFIG" --width="600" --height="300" \
--column="Доступные Варианты  " \
"Активировать Flatpak" \
"Отключить Flatpak" \
"Убирайся" \
)
if [[ $opPrincipal == "Активировать Flatpak" ]]; then
_activar
_fin_es
fi
if [[ $opPrincipal == "Отключить Flatpak" ]]; then
_desactivar
_fin_es
fi
if [[ $opPrincipal == "Убирайся" ]]; then
_salir
fi
}

# =========================================================================================

_idioma
